README.org
#+TITLE: Readme
#+AUTHOR: Paure

* Project

This project has for purpose to resolve the /'Dining Philosophers'/ problem in C by using multithreading.

It's divided into 3 solutions.

First one uses threads and mutex.

Second one uses threads and semaphores.

Third one uses process and semaphores.

* Usage

~make~ in one of the directories

~./philo_one {number_of_philosophers} {time_to_die} {time_to eat} {time_to_sleep} {number_of_time_of_each_philosophers_must_eat(optionnal)}~
