README.md

# Table of Contents

1.  [Project](#orgefd78dd)
2.  [Usage](#org8e49cd9)



<a id="orgefd78dd"></a>

# Project

This project has for purpose to resolve the *&rsquo;Dining Philosophers&rsquo;* problem in C by using multithreading.

It&rsquo;s divided into 3 solutions.

First one uses threads and mutex.

Second one uses threads and semaphores.

Third one uses process and semaphores.


<a id="org8e49cd9"></a>

# Usage

`make` in one of the directories

`./philo_one {number_of_philosophers} {time_to_die} {time_to eat} {time_to_sleep} {number_of_time_of_each_philosophers_must_eat(optionnal)}`

